Revit 2026 API

# LoadCombinationSetComponents Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetComponents(
	IList<LoadComponent> components
)
```
```vb
Public Sub SetComponents (
	components As IList(Of LoadComponent)
)
```
```cpp
public:
void SetComponents(
	IList<LoadComponent^>^ components
)
```
```fsharp
member SetComponents :
        components : IList<LoadComponent> -> unit
```

#### Parameters

components IListLoadComponent

#### Reference

LoadCombination Class

Autodesk.Revit.DB.Structure Namespace